return [[闲言隐私政策协议（闲言全称“闲言APP”）
生效时间：2020年2月18日  
此协议 第3次更新

引言  

闲言App（以下简称为“我们”或“闲言”）尊重并保护所有使用闲言平台服务用户的个人隐私权。为同时给您提供更准确、有个性化的服务和更安全的互联网环境，我们依据《中华人民共和国网络安全法》、《信息安全技术个人信息安全规范》（GB/T 35273-2017）以及其他相关法律法规和技术规范，特制订本政策。  

本政策与您所使用的我们的产品与/或服务息息相关，您在下载、安装、启动、浏览、注册、登录、使用我们的产品与/或服务（以下统称“使用我们的产品与/或服务”）时，我们将按照本政策的约定处理和保护您的个人信息。我们尽量以简明扼要的表述向您解释本政策所涉及的技术词汇，以便于您理解。  

闲言特别提请未满18周岁的未成年（特别是未满十四周岁的儿童）及其监护人的注意，我们有针对未成年人个人信息的相关的条款，请您仔细阅读。  

请在使用/继续使用我们的各项产品与服务前，仔细阅读并充分理解本政策，并在需要时，按照本政策的指引，作出适当的选择。如果您不同意本政策的内容，将可能导致我们的产品与/或服务无法正常运行，或者无法达到我们拟达到的服务效果，您应立即停止访问/使用我们的产品与/或服务。您使用或继续使用我们提供的产品与/或服务的行为，都表示您充分理解和同意本《闲言用户隐私政策》的全部内容。  

关于我们  

闲言网站及APP的经营者为 李圳洋 

常用办公地址为 
云南省红河州弥勒市吉山北路2环南写字楼3楼10号

目录  

一、我们如何收集和使用您的个人信息 
二、我们如何共享、转让、公开披露您的个人信息 
三、我们如何存储和保护您的个人信息 
四、您如何管理您的个人信息 
五、您如何注销您的账号 
六、我们如何使用Cookie和其他同类技术 
七、我们如何更新隐私政策 
八、未成年人保护 
九、如何联系我们
十、其他

一、我们如何收集和使用您的个人信息 
我们会遵循正当、合法、必要的原则，出于本政策所述的以下目的，收集和使用您在使用我们服务过程中主动提供或因使用我们产品和/或服务而产生的个人信息。如果我们要将您的个人信息用于本政策未载明的其它用途，或基于特定目的将收集而来的信息用于其他目的，我们将以合理的方式向您告知，并在使用前再次征得您的同意:

1. 账号注册及登录  
您注册并登录闲言帐号时， 需要向我们提供以下信息：帐号名称、和用户邮箱。提供上述信息并同意《闲言隐私协议》和本指引后，您可以使用闲言的核心业务功能，包括：浏览闲言平台内的内容。您浏览以后所产生的数据文件均保存在本地，
文件夹目录为:内置存储/WordsLeisure/wallpaper/
该目录内的文件用户可自行删除。

2. 向您提供产品和/或服务
A. 向您提供闲言产品和/或服务的核心业务功能 
为实现闲言的核心业务功能，我们可能需要向您收集个人信息。
以下将详细列出闲言的核心业务功能及为实现该功能所需收集的个人信息，若您拒绝收集，则无法使用该服务。 
浏览、关注与收藏功能。
您可浏览的内容包括文章、评论、文章等；在浏览的过程中，您还可以关注您感兴趣的用户、专栏、问题、话题、收藏，并收藏上述内容。
为此， 我们可能会收集您使用闲言时的设备信息，如设备型号、唯一设备标识符、操作系统、分辨率、电信运营商等软硬件信息。我们还可能收集您的浏览器类型，以此来为您提供信息展示的最优方案。此外，在您使用浏览和收藏功能的过程中，我们会自动收集您使用闲言的详细情况，并作为有关的网络日志保存，包括但不限于您输入的搜索关键词信息和点击的链接，您浏览和发布的内容及评论信息，您上传的图片信息、您的交易信息、您使用的语言、访问的日期和时间、及您请求的网页记录、操作系统、软件版本号、登录 IP 信息。
 在此过程中，我们会收集您的浏览记录，浏览记录包括您浏览的文章、收藏， 您可以自主删除浏览记录。 
您注册成为闲言用户后，可在闲言平台上对文章作出赞同、分享，在此过程中，我们可能会收集您的设备信息、运营商信息、日志信息。
B．向您提供闲言产品和/或服务的附加业务功能  
为了向您提供更优质的产品和服务，我们可能需要收集下述信息。
如果您拒绝提供下述信息，不影响您正常使用
 2.2 A 项所描述的闲言核心业务功能，但我们无法向您提供某些特定功能和服务。  

搜索功能。当您使用闲言提供的搜索功能时，我们会收集您查询的关键字信息以及您在使用闲机服务时所阅览或要求的其他信息和内容详情。为了给您带来更便捷的搜索服务并不断完善闲言产品和/或服务，我们可能会使用浏览器网络存储机制（包括 HTML5 ）和应用数据缓存，收集您设备上的信息并进行本地存储。
该等关键词信息通常无法单独识别您的个人身份，不属于您的个人信息，不在本指引的限制范围内。只有当您的搜索关键词信息与您的其他信息有联结并可识别您的个人身份时，则在结合使用期间，我们会将您的搜索关键词信息作为您的个人信息，与您的搜索历史记录一同按照本指引对其进行处理与保护。

定位功能。当您开启设备定位功能并使用闲言基于位置提供的相关服务时，我们会收集有关您的位置信息。

客户服务。当您向闲言提起投诉、申诉或进行咨询时，为了方便与您联系或帮助您解决问题， 我们可能需要您提供姓名、手机号码、电子邮件及其他联系方式等个人信息。 如您拒绝提供上述信息，我们可能无法向您及时反馈投诉、申诉或咨询结果。 

定向推送。
我们会基于收集的信息，对您的偏好、习惯、位置作特征分析和用户画像，以便为您提供更适合的定制化服务，例如向您展现或推荐相关程度更高（而非普遍推送）的搜索结果、信息流或者广告/推广信息结果。为此，我们需要收集的信息包括您的设备信息、浏览器型号、日志信息、浏览记录。 

支付功能。您可在闲言购买会员服务。在您使用该功能的过程中可能会需要进行支付，在支付过程中， 我们可能会收集您的第三方支付帐号(例如支付宝帐号、Apple Pay 帐号或其他形式的银行卡信息)，如果您开通了指纹支付，我们还可能需要收集您的生物识别信息用于付款验证。 

营销活动。
我们将会不时举办线上或线下的营销活动，或用户主动参与闲言站内的有奖问答活动等。 在此类营销活动中，我们可能需要用户提供身份信息或收件信息，以便我们能够提供票务服务或寄送礼品。在涉及闲言向您支付费用的情况下，我们可能需要收集您的身份信息用于代缴税款。


C．我们仅会在您的授权同意的范围内收集并使用您的个人信息。 在您注册或登录后，您的账号会立即生效，但您可以在【我的sup会员】中选择注销，进行注销操作。 
补充:用户退出账号以后，该软件自动删除用户在本地产生的数据文件恢复未登录状态；
用户注销账号以后，该软件清除用户所有数据，并清理用户注册的账户，恢复未登录状态。

D．敏感信息  
在向闲言提供任何属于敏感信息的个人信息前，请您清楚考虑该等提供是恰当的并且同意您的个人敏感信息可按本指引所述的目的和方式进行处理。 我们会在得到您的同意后收集和使用您的敏感信息以实现与闲言业务相关的功能，并允许您对这些敏感信息的收集与使用做出不同意的选择，但是拒绝使用这些信息会影响您使用相关功能。  

E.征得授权同意的例外  
根据相关法律法规的规定，在以下情形中，我们可以在不征得您的授权同意的情况下收集、使用一些必要的个人信息：  
a. 与国家安全、国防安全直接相关的； 
b. 与公共安全、公共卫生、重大公共利益直接相关的； 
c. 与犯罪侦查、起诉、审判和判决执行等直接相关的； 
d. 出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的； 
e. 所收集的个人信息是您自行向社会公众公开的； 
f. 从合法公开披露的信息中收集到您的个人信息，如从合法的新闻报道、政府信息公开等渠道； 
g. 根据您的要求签订和履行合同所必需的； 
h. 用于维护闲言的产品和/或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障； 
i. 法律法规规定的其他情形。 

如果您对我们收集和使用您的个人信息的法律依据有任何疑问或需要提供进一步的信息，请通过「如何联系我们」一节提供的联系方式与我们联系。 

二、我们如何共享、转让、公开披露您的个人信息 
A. 我们不会与任何公司、组织和个人共享您的个人信息，但以下情况除外：  
事先获得您的明确授权或同意： 获得您的明确同意后，我们会与其他方共享您的个人信息； 

在法定情形下的共享：根据适用的法律法规、法律程序、政府的强制命令或司法裁定而需共享您的个人信息； 

在法律要求或允许的范围内，为了保护闲言及其用户或社会公众的利益、财产或安全免遭损害而有必要提供您的个人信息给第三方； 

与我们的关联公司共享：您的个人信息可能会在我们的关联公司之间共享。我们只会共享必要的个人信息，且这种共享受本指引所声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意； 

与授权合作伙伴共享：为了向您提供更完善、优质的产品和服务，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。例如，闲言向您寄送礼品时，闲言需要与物流服务提供商共享您的个人信息才能安排寄送。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。同时，我们会与合作伙伴签署严格的保密协定，要求他们按照我们的说明、本指引以及其他任何相关的保密和安全措施来处理您的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途。如果您拒绝我们的合作伙伴在提供服务时收集为提供服务所必须的个人信息，将可能导致您无法在闲言中使用该第三方服务。 

目前，我们的授权合作伙伴包括以下类型：  
广告、分析服务类的授权合作伙伴。 除非得到您的许可，否则我们不会将您的个人身份信息（指可以识别您身份的信息，例如姓名或电子邮箱）与提供广告、分析服务的合作伙伴分享。对于广告合作伙伴，我们可能会向其提供有关其广告覆盖面和有效性的信息，而不会提供您的个人身份信息，或者我们将这些信息进行匿名化处理，以便它不会识别到您个人。对于分析数据的伙伴，为了更好的分析闲言用户的使用情况，我们可能向其提供闲的用户的数量、地区分布、活跃情况等数据，但我们仅会向这些合作伙伴提供不能识别个人身份的统计信息（例如「位于北京的25岁男性，喜欢软件开发」）； 



供应商、服务提供商和其他合作伙伴。 我们将信息发送给在全球范围内支持我们业务的供应商、服务提供商和其他合作伙伴共享（例如代表我们发出电邮或推送通知的通讯服务供应商，以及向为我们和您提供协助的地图服务供应商分享位置数据，向提供人脸识别的服务供应商提供帐号名称和头像图片数据），这些信息的用途受到如下限制： 

协助我们向您提供服务； 
协助我们履行在上文「向您提供产品和/或服务」一节所载的目的； 
履行我们根据《闲言隐私政策》实现我们的权利，及或协助理解和改善闲言提供的服务； 提供技术基础设施服务、分析我们服务的使用方式、衡量广告和服务的有效性、支付便利或进行学术研究和调查。   

B.有关共享信息的提示：通过由我们或第三方提供的功能，您可以主动公开分享、共享信息（如向其他互联网平台转发内容），在这种情况下共享信息将被广泛并即时传送。  

但只要您不删除被共享的信息，该信息会一直留存在公众领域；在一些情况下，即使您删除共享信息，该等信息仍可由其他用户或与我们没有关联及不受我们控制的第三方独立地缓存、复制或储存，或通过其他用户或该等第三方在公众领域保存。
转让
转让是指将取得您个人信息的控制权转让给其他公司、组织或个人。除非获取您的明确同意，否则我们不会将您的个人信息转让给任何公司、组织或个人。但下述情形除外：  

事先已征得您的同意； 
您自行提出的； 
如果公司发生合并、收购或破产清算，将可能涉及到个人信息转让，此种情况下我们会要求新的持有您个人信息的公司、组织继续受本政策的约束。否则我们将要求其重新获取您的明示同意。 
其他法律法规规定的情形。 

公开披露：  
公开披露是指向社会或不特定人群发布信息的行为。除了因公布账号中奖、处罚通知时展示相关脱敏信息或者取得您的明确同意而进行必要的公开披露外，我们不会对您的个人信息进行披露。但下述情况除外：  

基于法律规定、司法机关或行政机关强制性要求的情况下，我们可能会向有权机关披露您的个人信息。但我们保证，在上述情况发生时，我们会要求披露请求方必须出具与之相应的有效法律文件，并对被披露的信息采取符合法律和业界标准的安全防护措施。 

共享、转让、公开披露个人信息授权同意的例外情形：  

根据相关法律法规的规定，在以下情形中，我们可以在不征得您的授权同意的情况下共享、转让、公开披露您的个人信息：  

与公共安全、公共卫生、重大公共利益有关的； 
与犯罪侦查、起诉、审判和判决执行等有关的； 
出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的； 
您自行向社会公众公开的个人信息； 
从合法公开披露的信息中收集到的个人信息的，如合法的新闻报道、政府信息公开等渠道。 
法律法规规定的其他情形。 
根据法律规定，共享、转让经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。

三、我们如何存储和保护您的个人信息  

存储：  
存储地点：我们将从中华人民共和国境内获得的信息存放于中华人民共和国境内。如果发生数据的跨境传输，我们会单独向您以站内通知或邮件的方式告知您数据出境的目的、接收方等，并征得您的授权同意，我们会严格遵守中国的法律法规，确保数据接收方有充足的数据保护能力来保护您的个人信息。  

存储时间：我们承诺始终按照法律的规定在合理必要期限内在存储您个人信息。  

保护：  
为了保护您的个人信息安全，我们将努力采取各种符合行业标准的安全措施来保护您的个人信息以最大程度降低您的信息被毁损、盗用、泄露、非授权访问、使用、披露和更改的风险。我们将积极建立数据分类分级制度、数据安全管理规范、数据安全开发规范来管理规范个人信息的存储和使用，确保未收集与我们提供的服务无关的个人信息。  

您的账户均有安全保护功能，请妥善保管您的账户及密码信息。闲言将通过向其它服务器备份、对用户密码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您注意在信息网络上不存在“完善的安全措施”。为防止安全事故的发生，我们已按照法律法规的规定，制定了妥善的预警机制和应急预案。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况，紧密配合政府机关的工作。  


四、您如何管理您的信息 
1. 您管理个人信息的权利  

我们非常重视您对个人信息的关注，并尽全力保护您对于自己个人信息访问、更正、删除以及撤回同意的权利，以使您拥有充分的能力保障您的隐私和安全。

2.访问和更正您的个人信息 

您可以对自己个人信息访问、更正、删除的权利。您可通过【我的sup会员】访问、更正自己的个人资料，设置、访问、更正账号信息。您可通过【收藏】访问、删除相关信息。 

3.技术措施与数据安全措施  

我们努力采取各种符合业界标准的物理、电子和管理方面的安全措施来保护您的个人信息安全。我们积极建立数据分类分级制度、数据安全管理规范、数据安全开发规范来管理规范个人信息的存储和使用，确保未收集与我们提供的服务无关的个人信息。  

我们通过与信息接触者签署保密协议、监控和审计机制来对数据进行全面安全控制。防止您的个人信息遭到未经授权的访问、公开披露、使用、修改、损坏或丢失。  

我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权的访问、公开披露、使用、修改，防止数据发生损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。例如，在您的浏览器与闲言之间交换数据（如信用卡信息）时受 SSL 加密保护；我们同时对本指引「引言」中出现的网站提供 https 安全浏览方式；我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可以访问个人信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。  

4.设备权限调用  

我们在提供服务的过程中，可能需要您开通一些设备权限，例如通知、相册、相机、手机通讯录、蓝牙等访问权限。 您也可以在设备的【设置】功能中随时选择关闭部分或者全部权限，从而拒绝我们收集您相应的个人信息。在不同设备中，权限显示方式及关闭方式可能有所不同，具体请参考设备及系统开发方说明或指引。
 
五、您如何注销您的账号  

A. 我们在闲言 App 上提供以下方式
您可通过【收藏】，删除您收藏的单个话题或您建立的收藏夹； 

B. 在以下情形中，您可以向我们提出删除个人信息的请求： 

如果我们处理个人信息的行为违反法律法规； 
如果我们收集、使用您的个人信息，却未征得您的同意； 
如果我们处理个人信息的行为违反了与您的约定； 
如果您注销了闲言帐号； 
如果我们终止服务及运营。 
以上删除请求一旦被响应，会及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。当您从我们的服务中删除信息后，我们可能不会立即从备份系统中删除相应的信息，但会在备份更新时删除这些信息。  

如果您在删除过程中遇到任何问题，请发送邮件至2821991550@qq.com联系我们。我们会在3工作日回复您的请求。
 
C．如何注销您的账号

如果您需要注销您的闲言帐号，您可以通过【注销账号】操作注销，或者发送邮件至 2821981550@qq.com要求对您的闲言帐号进行注销。我们将在验证您的身份并清理帐号中的资产（包括已购买的闲言服务等）后，为您提供帐号注销服务。  

为了向您提供更加便捷的注销方式，我们后续会不断优化我们的产品，并且通过页面公告向您告知。在注销帐号之后，我们将停止为您提供产品或服务，并依据您的要求，删除您的个人信息，法律法规另有规定的除外。  

您注销成功后，我们将根据法律法规的要求尽快删除您的个人信息或作匿名化处理。 

六、我们如何使用Cookie和其他同类技术  

在您未拒绝接受cookies的情况下，闲言会在您的计算机以及相关移动设备商上设定或取用cookies，以便您能登录或使用依赖于cookies的闲言平台服务或功能。闲言使用cookies可为您提供更加周到的个性化服务，包括推广服务。

您有权选择接受或拒绝接受cookies。您可以通过修改浏览器设置的方式或在移动设备中设置拒绝接受cookies。但如果您选择拒绝接受cookies，则您可能无法登录或使用依赖于cookies的闲言平台服务或功能。  

通过闲言所设cookies所取得的有关信息，将适用本政策。  

七、我们如何更新隐私政策  

我们保留不时更新或修订本隐私政策的权利。  

如遇本隐私政策更新，我们会通过APP客户端推送通知等合理方式通知您，以便您能及时了解本隐私政策所做的任何变更。  


八、未成年人保护  

闲言服务主要面向成人。我们的产品、网站和服务主要面向成人。若您是 18 周岁以下的未成年人，在使用我们的产品和/或服务前，您应在监护人的陪同下阅读本指引，并应确保已征得您的监护人同意后使用我们的服务并向我们提供您的信息。 我们会根据国家相关法律法规的规定着重保护未成年人的个人信息。  

如您的监护人不同意您按照本指引使用我们的服务或向我们提供信息，请您立即终止使用我们的服务并及时通知我们。  

对于经父母或法定监护人同意而收集未成年人个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护未成年人所必要的情况下使用或公开披露此信息。  

若您是未成年人的监护人，当您对您所监护的未成年人使用我们的服务或其向我们提供的用户信息有任何疑问时，请您及时与我们联系。我们将根据国家相关法律法规及本指引的规定保护未成年人用户信息的保密性及安全性。如果我们发现自己在未事先获得可证实的父母或法定监护人同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关数据。  

九、如何联系我们  

当您对本政策有任何疑问，可以发送邮件至【2821981550@qq.com】联系我们，我们会在10日内予以答复。  

个人信息安全负责人为李圳洋，
联系邮箱为 2821981550@qq.com
联系电话  13150626278
软件稳定性和兼容性问题反馈 张子超
联系邮箱为  1773798610@qq.com

十、其他  
  您可以通过 闲言 App 内的【关于】-【隐私政策】再次打开该协议。

因本政策以及我们处理您个人信息事宜引起的任何争议，您可诉至红河州弥勒市人民法院。 

如果您认为我们的个人信息处理行为损害了您的合法权益，您也可向有关政府部门进行反映。 
]]